//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   Money.h
//!
//! @brief  お金クラスのヘッダファイル
//!
//! @date   2018/01/26
//!
//! @author N.Sakuma
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

//インクルード
#include "Money.h"

//定数
#pragma region Constant
//1000円札の価値
const int Money::sBILL1000_VALUE = 1000;
//500円玉の価値
const int Money::sCOIN500_VALUE = 500;
//100円玉の価値
const int Money::sCOIN100_VALUE = 100;
//50円玉の価値
const int Money::sCOIN50_VALUE = 50;
//10円玉の価値
const int Money::sCOIN10_VALUE = 10;
#pragma endregion

//----------------------------------------------------------------------
//! @brief コンストラクタ
//!
//! @param[in] なし
//----------------------------------------------------------------------
Money::Money()
{
	//ストックを0にする
	Reset();

	//お金に価値を付与する
	//1000円札
	m_value[BILL1000] = 1000;
	//500円玉
	m_value[COIN500]  =  500;
	//100円玉
	m_value[COIN100]  =  100;
	//50円玉
	m_value[COIN50]   =   50;
	//10円玉
	m_value[COIN10]   =   10;

}

//----------------------------------------------------------------------
//! @brief お金の在庫の追加
//!
//! @param[in] お金の種類、追加する数
//!
//! @return なし
//----------------------------------------------------------------------
void Money::AddMoney(int kind, int addNum)
{
	m_moneyStock[kind] += addNum;
}

//----------------------------------------------------------------------
//! @brief お金の在庫の削除
//!
//! @param[in] お金の種類、削除する数
//!
//! @return なし
//----------------------------------------------------------------------
void Money::DeleteMoney(int kind, int deleteNum)
{
	m_moneyStock[kind] -= deleteNum;
}

//----------------------------------------------------------------------
//! @brief お金の在庫のgetter
//!
//! @param[in] お金の種類
//!
//! @return 在庫
//----------------------------------------------------------------------
int Money::GetMoney(int kind)
{
	return m_moneyStock[kind];
}

//----------------------------------------------------------------------
//! @brief お金の価値のgetter
//!
//! @param[in] お金の種類
//!
//! @return 価値
//----------------------------------------------------------------------
int Money::GetValue(int & kind)
{
	return m_value[kind];
}

//----------------------------------------------------------------------
//! @brief お金をリセットする
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void Money::Reset()
{
	for (int i = 0; i < MONEYTYPE_NUM; i++)
	{
		m_moneyStock[i] = 0;
	}
}
